src/Catalogs/гф_НоменклатураВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>гф_НоменклатураВнешнихСистем</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИДВнешнейСистемы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДВнешнейСистемы2</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.гф_ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/гф_ЗначенияСвойствНоменклатурыВнешнейСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ЗначенияСвойствНоменклатурыВнешнейСистемы</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураВнешнейСистемы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_НоменклатураВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/гф_ЗначенияХарактеристикНоменклатурыВнешнейСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ЗначенияХарактеристикНоменклатурыВнешнейСистемы</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураВнешнейСистемы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_НоменклатураВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/гф_НоменклатураВнешнихСистем/Forms/гф_ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		СвойстваНоменклатуры.Очистить();    
		ОтборСвойстваНоменклатуры = РегистрыСведений.гф_ЗначенияСвойствНоменклатурыВнешнейСистемы.СоздатьНаборЗаписей();
		
		ОтборСвойстваНоменклатуры.Отбор.НоменклатураВнешнейСистемы.Использование = Истина;
		ОтборСвойстваНоменклатуры.Отбор.НоменклатураВнешнейСистемы.Значение = Объект.Ссылка;
		ОтборСвойстваНоменклатуры.Прочитать();
		ЗначениеВДанныеФормы(ОтборСвойстваНоменклатуры, СвойстваНоменклатуры);
		
		СвойстваХарактеристик.Очистить();  
		ОтборСвойстваХарактеристик = РегистрыСведений.гф_ЗначенияХарактеристикНоменклатурыВнешнейСистемы.СоздатьНаборЗаписей();
		ОтборСвойстваХарактеристик.Отбор.НоменклатураВнешнейСистемы.Использование = Истина;
		ОтборСвойстваХарактеристик.Отбор.НоменклатураВнешнейСистемы.Значение = Объект.Ссылка;
		ОтборСвойстваХарактеристик.Прочитать(); 
		ЗначениеВДанныеФормы(ОтборСвойстваХарактеристик, СвойстваХарактеристик);
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	текСсылка = ТекущийОбъект.Ссылка;
	
	СвойстваНоменклатурыЗапись = ДанныеФормыВЗначение(СвойстваНоменклатуры, Тип("РегистрСведенийНаборЗаписей.гф_ЗначенияСвойствНоменклатурыВнешнейСистемы"));
	Если СвойстваНоменклатурыЗапись.Количество() > 0 Тогда
		Для каждого СтрокаЗаписи из СвойстваНоменклатурыЗапись Цикл
			СтрокаЗаписи.НоменклатураВнешнейСистемы = текСсылка;
		КонецЦикла;
	    СвойстваНоменклатурыЗапись.Записать();
	КонецЕсли;
	
	СвойстваХарактеристикЗапись = ДанныеФормыВЗначение(СвойстваХарактеристик, Тип("РегистрСведенийНаборЗаписей.гф_ЗначенияХарактеристикНоменклатурыВнешнейСистемы"));
	Если СвойстваХарактеристикЗапись.Количество() > 0 Тогда
		Для Каждого СтрокаЗаписи из СвойстваХарактеристикЗапись Цикл
			СтрокаЗаписи.НоменклатураВнешнейСистемы = текСсылка;
		КонецЦикла;
		СвойстваХарактеристикЗапись.Записать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСвойстваХарактеристикПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекДанные.Характеристика) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите характеристику");
		Отказ = Истина;
		ОтменаРедактирования = Истина;
	КонецЕсли;
	
КонецПроцедуры
